{
  "numbers": {
    "1": {
      "overview": "Number 1 is the spark—the clean beginning, the east‑facing door at dawn. It carries initiative, clarity, and the will to move first. When 1 is strong, life asks you to lead by example: simple starts, plain words, and honest action. You’re learning the difference between self‑trust and defensiveness; the former is quiet and consistent, the latter is loud and brittle. In practice, 1 works best with short feedback loops. Plan the next right step and take it before the mood changes. When anxiety wants a ten‑year strategy, choose a ten‑minute start. Your medicine is momentum built on truth, not performance.",
      "strengths": "Courage to begin; clear seeing; direct speech; ability to simplify a complex field into the next visible step. People feel safer when you decide cleanly and own the outcome. You can set a tone that removes dithering and gives everyone back an hour.",
      "challenges": "Impatience; ‘soloing’ when partnership would help; equating speed with worth; burning out on sprints without a finish line. Watch the reflex to win arguments—being right is cheaper than being wise.",
      "relationships": "1 brings leadership energy into love and friendship. That can feel like safety or like steamrolling depending on tone. Invite collaboration by asking, “What would good look like for both of us today?” Choose small promises you can keep; consistency is intimacy.",
      "watchouts": "Pushing when a pause would clarify; speaking first, listening last; starting five things to avoid finishing one. Beware the myth that you’ll be ready after you know everything—you learn by moving.",
      "coaching": "Define ‘done’ for one task in one sentence. Take a 25‑minute focus run with devices quiet. Close with a two‑line debrief: what moved, what’s next. Practice asking for help when the wise move is shared effort. Lead by making kindness the first move, not the reward."
    },
    "2": {
      "overview": "Number 2 is living balance—the duet, the bridge, the space between notes. It brings cooperation, listening, and the gift of harmonising different truths. Under 2, life teaches you to weave: your needs, their needs, and the shared aim in the middle. When 2 is ignored, you over‑give and then resent; when honoured, you ask cleanly and receive with grace. Agreements, not assumptions, are your craft.",
      "strengths": "Diplomacy; empathy; pattern‑sensing in relationships; the ability to calm rooms and translate points of view without losing the thread of purpose.",
      "challenges": "People‑pleasing; delay disguised as ‘being considerate’; swallowing needs until they return as sarcasm. Boundaries are instruments, not punishments.",
      "relationships": "2 makes you a natural partner. Signal your needs early and plainly. Replace mind‑reading with micro‑agreements: who does what by when, and how we’ll check in. Harmony built on silence collapses; harmony built on honesty sings.",
      "watchouts": "Saying yes when your body says no; avoiding conflict until it becomes bigger than it needed to be. Over‑consulting the room instead of consulting your values.",
      "coaching": "Practice the two‑step: reflect (“I heard…”) then ask (“What would help today?”). Write one boundary as a positive promise to yourself and keep it for seven days. Balance means shared pace, not equal effort every hour."
    },
    "3": {
      "overview": "Number 3 is expression and signal—words, pictures, music, the courage to be seen. It wants you to say the true thing in a way your future self respects. 3 is social and sunny, but the deeper lesson is editing: shaping the channel so message survives the mood.",
      "strengths": "Creative flow; contagious enthusiasm; talent for reframing problems so others can act. You help groups name what they’re doing and why it matters.",
      "challenges": "Scatter; performing instead of communicating; confusing volume for reach. A dozen posts are weaker than one honest message that lands.",
      "relationships": "Your voice sets climate at home. Replace jokes that deflect with jokes that include. Name appreciations out loud; unspoken gratitude goes stale.",
      "watchouts": "Oversharing as a way to avoid intimacy; promising more than you can ship. Keep your calendar kind to your craft.",
      "coaching": "Pick one medium today. Ship one thing to one audience. Edit once for clarity, once for kindness. The right readers will find the voice that is clean rather than loud."
    },
    "4": {
      "overview": "Number 4 is good structure—the bench and four patient stones. It’s craft, systems, containers, muscle memory. Under 4 you build frames that help talent survive bad weather. Stability isn’t boring; it’s freedom on good days and mercy on hard ones.",
      "strengths": "Reliability; process thinking; the discipline to keep simple promises daily. You make chaos do push‑ups until it behaves.",
      "challenges": "Rigidity; perfectionism; mistaking control for safety. Over‑engineering can choke the life you’re trying to support.",
      "relationships": "4’s love language is kept rhythm—shared chores, predictable check‑ins, a home that works. Let structure serve tenderness, not replace it.",
      "watchouts": "Becoming the project manager of everyone’s life; confusing stillness with stagnation. Rest is a system, too.",
      "coaching": "Template one repeating task. Remove one unnecessary step. Protect a 90‑minute block for the thing that lifts everything else. Small, true, repeated—that’s how 4 changes a life."
    },
    "5": {
      "overview": "Number 5 is change with a seatbelt—curiosity, range, fresh air through a stale room. It asks you to experiment safely and integrate quickly. Under 5, growth comes from swapping one habit at a time, not detonating your life for a vibe.",
      "strengths": "Adaptability; learning speed; hospitality to the new. You can scout possibilities others miss and return with what works.",
      "challenges": "Restlessness; novelty chasing; burning bridges you’ll need next season. Freedom without rhythm becomes fatigue.",
      "relationships": "5 brings adventure to love when paired with consideration. Share maps, not surprises. The right amount of new keeps the bond alive.",
      "watchouts": "Confusing discomfort with danger; abandoning projects at 80% because the thrill moved on. Choose finish lines before you start.",
      "coaching": "Design ‘bounded play’: one variable, one week, one review. Keep what helped; discard what didn’t without drama. Range becomes wisdom when measured."
    },
    "6": {
      "overview": "Number 6 is care and repair—domestic leadership, belonging, the impulse to make things gentle and true. It’s not martyrdom; it’s stewardship with boundaries. Under 6, love becomes a practice you can keep even when you’re tired.",
      "strengths": "Soothing presence; practical nurture; capacity to host, mediate, and mend without making a show of it. You remember birthdays and where the spare batteries live.",
      "challenges": "Over‑responsibility; resentment from over‑giving; erasing your needs to keep peace. Care without consent becomes control.",
      "relationships": "6 teaches intimacy through small repeats: a nightly reset, a weekly walk, a standing check‑in. Warmth is a schedule, not a mood.",
      "watchouts": "Guilt as a compass; cleaning as a way to avoid conversations. Ask for help before exhaustion speaks for you.",
      "coaching": "Write a ‘kind boundary’ as a single sentence and practice saying it. Make the house five percent easier to keep. Praise effort kept, not perfection achieved."
    },
    "7": {
      "overview": "Number 7 is quiet insight—the study, the lamp, the margin note that solves it later. It prefers depth to display. Under 7, your task is to separate signal from noise and protect the conditions where truth can find you.",
      "strengths": "Discernment; pattern recognition; integrity with your own research. You learn fast when left to think and you respect evidence.",
      "challenges": "Withdrawing too far; analysis paralysis; mistaking skepticism for wisdom. Don’t outsource courage to certainty.",
      "relationships": "Share your inner world sooner. People who love you want a window, not a report. Curiosity and warmth make your brilliance usable.",
      "watchouts": "Endless preparation; moving goalposts for ‘ready’. Insight that never ships turns into self‑doubt.",
      "coaching": "Choose one clean question. Work in 50‑minute focus runs. Publish your notes weekly—even rough—so learning compounds outside your head."
    },
    "8": {
      "overview": "Number 8 is calm strength—stewardship, resources, sustained effort. It’s the quiet forge where promises harden into trust. Under 8 you practice power that serves: measured, ethical, generous without leaking yourself empty.",
      "strengths": "Execution; financial sense; ability to build teams and systems that last. You can hold a long arc without losing the day.",
      "challenges": "Over‑control; worth tied to output; forgetting softness. Efficiency without empathy becomes a desert.",
      "relationships": "8 loves in deeds: reliability, provision, protection. Pair it with tenderness—eyes up when they enter, a warm voice, shared play.",
      "watchouts": "Carrying it all; confusing urgency with importance. Pride that refuses help until it breaks.",
      "coaching": "Name the assets you already have (skills, allies, tools). Invest in cadence over spectacle. Make one generous move weekly that costs little and helps much."
    },
    "9": {
      "overview": "Number 9 is clean completion—harvest, blessing, letting go before holding turns to harm. It integrates the story and chooses the kindest ending available. Under 9, compassion is policy, not just feeling.",
      "strengths": "Perspective; forgiveness; capacity to tie threads without punishing anyone for the knots. You can end things without burning the field.",
      "challenges": "Lingering; savior impulses; losing self at the altar of ‘goodness’. Closure delayed becomes a ghost that eats bandwidth.",
      "relationships": "9 heals by naming what is true now and releasing the fantasy of perfect fixes. Celebrate what was good; grieve what wasn’t; step into the next season light.",
      "watchouts": "Dragging endings; confusing guilt with responsibility. Saying ‘yes’ to avoid the grief of ‘no’.",
      "coaching": "Finish one open loop today. Write the thank‑you, archive the folder, return the key. Bless the lesson; carry only what you can love while carrying."
    },
    "11": {
      "overview": "Master 11 doubles the 1 and resolves to 2: inspiration seeking right relationship. It’s the lightning and the conduit, the insight and the conversation that grounds it. Under 11, you’re asked to speak truth with grace and to build agreements that can hold voltage.",
      "strengths": "Vision; moral clarity; catalytic words. You can see the higher path and invite others without shaming them for standing where they are.",
      "challenges": "All‑or‑nothing thinking; preaching; burnout from trying to be the light for everyone. Wisdom lands when the tone is human‑sized.",
      "relationships": "Remember the 2 inside the 11: equal airtime, shared decisions, a pace the partnership can keep. Translate ideals into small daily courtesies.",
      "watchouts": "Using intuition as a weapon; mistaking intensity for depth. Protect rest so the channel stays clear.",
      "coaching": "Pair each insight with one keepable behaviour. Host conversations where listening is the first miracle. Let your gift be portable and kind."
    },
    "22": {
      "overview": "Master 22 doubles the 2 and resolves to 4: the builder who listens, the architect who values the meeting as much as the blueprint. It wants big voltage to choose practical shoes—visions that can handle weather and neighbours.",
      "strengths": "Organisational magic; community projects; turning ideals into structures that work on Tuesday afternoon. You make hope tangible.",
      "challenges": "Rigidity in service of a ‘perfect’ plan; drowning in consensus. Remember why the structure exists: to serve people, not to impress them.",
      "relationships": "Choose rituals that carry love without a speech. Shared calendars, standing dates, clear chores—boring is holy when kept kindly.",
      "watchouts": "Micromanaging; forgetting play; resenting those who don’t move at your pace. Quality without warmth feels like a wall.",
      "coaching": "Build minimally viable structures: simple, breathable, repairable. Measure by usefulness, not elegance. Celebrate every kept promise."
    },
    "33": {
      "overview": "Master 33 doubles the 3 and resolves to 6: teaching that heals, creativity in service of care. It’s charisma with responsibility, the warm voice that remembers to rest. Under 33, your art is a shelter and your shelter is an art.",
      "strengths": "Mentoring; storytelling; translating pain into practices that help others. People learn because they feel safe with you.",
      "challenges": "Martyr teacher mode; over‑explaining; neglecting your own needs while rescuing. Service that erases you isn’t sacred, it’s unsustainable.",
      "relationships": "Make home a studio for kindness: small lessons, shared chores, unhurried presence. Love loves being taught gently and often.",
      "watchouts": "Advice without consent; giving until you vanish; guilt as a fuel source. Protect the artist so the healer stays honest.",
      "coaching": "Teach shorter; rest longer. Offer one useful practice, not ten inspiring ideas. Keep a boundary that lets your care stay warm tomorrow."
    }
  }
}