{
  "schema_version": "1.0",
  "notes": "Expanded numerology interpretations for 1–9, 11, 22, 33. Fields: overview, strengths, challenges, relationships, watchouts, coaching.",
  "numbers": {
    "1": {
      "overview": "Life Path 1 is the Pioneer. You’re wired for initiative, independence, and leadership. You do best when you set your own direction and move decisively. The core lesson is healthy self‑reliance: owning your decisions without becoming isolated or domineering. You’re at your happiest when you’re building something from scratch and proving to yourself that you can.",
      "strengths": "Drive, originality, courage, and a nose for opportunities. You spot the opening, act quickly, and can inspire others through your example. When you’re aligned, your confidence is contagious and you elevate the standards around you.",
      "challenges": "Impatience, stubbornness, and ‘my way or the highway’ energy. You can burn out by doing everything yourself or alienate allies by pushing too hard. Learning to delegate and to listen keeps your power clean.",
      "relationships": "Matches well with 3 and 5 (fun and momentum) and 2 or 6 (support and balance). Friction with 8 (power struggles) or 7 (withdrawal vs. control) unless both parties respect autonomy. In love, show warmth as well as direction.",
      "watchouts": "Watch the lone‑wolf pattern, competitiveness with partners, and quitting early if you’re not instantly the best. Pride can block useful feedback.",
      "coaching": "Build a ‘win team’—one person to challenge you, one to support you. Set clear goals with weekly checkpoints. Practice one act of receptive listening daily; it unlocks smarter leadership and healthier intimacy."
    },
    "2": {
      "overview": "Life Path 2 is the Diplomat. You’re tuned to harmony, empathy, and partnership. Your gift is relational intelligence—seeing both sides and creating bridges. Your life lesson is balancing your caring nature with self‑respect so you don’t disappear while keeping the peace.",
      "strengths": "Sensitivity, patience, collaboration, and intuition. People feel safe around you. You notice subtleties and can gently guide groups to consensus without force.",
      "challenges": "Over‑accommodating, indecision, people‑pleasing, and avoiding conflict. Bottled feelings can lead to resentment or anxiety. Boundaries are essential to protect your softness.",
      "relationships": "Excellent with 6 and 9 (shared care and ideals). Supportive with 4 (stability) and 8 (structure) when you speak up. Tension with 5 (chaos) or 1 (domineering) unless communication is clean. Your superpower in love is deep listening—use it without self‑erasing.",
      "watchouts": "Saying ‘yes’ when you mean ‘not yet’, mistaking peace for silence, and outsourcing decisions. Your intuition dims when you ignore your own needs.",
      "coaching": "Practice micro‑boundaries: ‘I’ll reply tomorrow’ is a complete sentence. Choose one non‑negotiable self‑care anchor daily. Schedule honest check‑ins so issues don’t calcify."
    },
    "3": {
      "overview": "Life Path 3 is the Communicator. Expression, creativity, and play are your lifeblood. You’re here to turn ideas and feelings into words, images, or performance that uplift others. The lesson is channelled focus—finishing what you start so your magic lands in the world.",
      "strengths": "Charisma, humour, storytelling, and encouragement. You can reframe heavy situations and help people see possibilities. Social energy opens doors for you.",
      "challenges": "Scattered focus, self‑doubt masked by jokes, and mood dips when validation is low. You may start many projects and finish few. Discipline is your amplifier.",
      "relationships": "Spark flies with 1 and 5 (adventure, momentum). Nourishing with 6 (home base) and 2 (emotional safety). Tension with 7 (privacy vs. openness) or 4 (rigid routine) unless you respect different tempos.",
      "watchouts": "Over‑sharing, procrastinating via perfectionism, and comparison spirals. When you numb with distractions, your voice dims.",
      "coaching": "Adopt ‘tiny shipping’: publish small, often. Maintain a capture list for ideas and a weekly ‘finish hour.’ Protect sleep and movement—your mood fuels your muse."
    },
    "4": {
      "overview": "Life Path 4 is the Builder. Structure, reliability, and craftsmanship define your path. You thrive with systems that turn chaos into steady progress. Your lesson is flexibility: keep your strong foundations but allow iterative change so you don’t get stuck in ‘the way it’s always been.’",
      "strengths": "Consistency, planning, grit, and practical wisdom. You create trust by doing what you said you would do—on time. Others lean on your dependability.",
      "challenges": "Rigidity, pessimism, and over‑work. You can mistake effort for effectiveness and miss smarter routes. Perfectionism may slow momentum.",
      "relationships": "Solid with 2 and 6 (shared loyalty) and 8 (goals). Growth with 9 (meaning) and 3 (lightness). Friction with 5 (freedom vs. rules) unless you both honour the other’s needs.",
      "watchouts": "Burnout from carrying too much, controlling tendencies, and fear of risk. Security is not the same as aliveness.",
      "coaching": "Implement ‘flex rules’: 80% structure, 20% experiment. Delegate one task weekly. Celebrate progress publicly to counter your inner critic."
    },
    "5": {
      "overview": "Life Path 5 is the Explorer. Freedom, variety, and experience are your curriculum. You learn by doing and are here to catalyse change—within yourself and for others. The lesson is mindful freedom: expanding without blowing up good foundations.",
      "strengths": "Adaptability, curiosity, sales/communication skills, and crisis handling. You thrive in movement and can turn setbacks into adventures.",
      "challenges": "Restlessness, impulsivity, and avoidance of commitments. Dopamine chasing can scatter your power and relationships if you don’t ground it.",
      "relationships": "Electric with 1 and 3 (momentum and fun). Growth with 7 (depth) and 9 (meaning). Tension with 4 (structure) or 6 (security) unless you co‑design routines with play built in.",
      "watchouts": "Over‑promising, escapism, and ghosting responsibilities. Freedom costs less when you plan it.",
      "coaching": "Use ‘containers for freedom’: set windows for spontaneity and windows for focus. Travel light, document your lessons, and commit to one habit that anchors you daily."
    },
    "6": {
      "overview": "Life Path 6 is the Nurturer. You’re oriented to care, beauty, and responsibility. Home, community, and service are sacred to you. Your lesson is balancing support for others with self‑care, so your giving comes from overflow, not depletion.",
      "strengths": "Warmth, loyalty, design sense, and steady leadership. You create environments where people feel held and can grow. You notice what needs fixing and quietly fix it.",
      "challenges": "Over‑giving, rescuing, and control through caretaking. You may internalise others’ problems and then feel unappreciated. Boundaries and shared responsibility are key.",
      "relationships": "Harmonious with 2 and 9 (shared compassion). Stable with 4 and 8 when duties are clear. Tension with 5 (freedom vs. duty) unless you allow space and negotiate needs explicitly.",
      "watchouts": "Martyrdom, perfection in the home, and postponing your own dreams. Love includes you.",
      "coaching": "Schedule ‘care for the carer’ time first. Ask for help before resentment builds. Beautify one small corner daily; it nourishes your nervous system."
    },
    "7": {
      "overview": "Life Path 7 is the Seeker. You’re drawn to knowledge, truth, and spiritual insight. You process life through analysis and intuition, needing solitude to integrate. The lesson is trust—of self, of others, and of the unseen—so your wisdom can circulate, not isolate.",
      "strengths": "Depth, research ability, pattern recognition, and spiritual sensitivity. You can decode complexity and mentor others through labyrinths of thought and feeling.",
      "challenges": "Isolation, scepticism, and over‑thinking. You may struggle to translate insight into action or to be emotionally available when overloaded.",
      "relationships": "Compatible with 2 and 6 (emotional grounding) and 9 (shared ideals). Challenging with 1 or 8 (control/ambition clashes) unless autonomy is respected. You need honest, spacious connection.",
      "watchouts": "Rumination, cynicism, and retreating when intimacy knocks. Wisdom wants a voice.",
      "coaching": "Create rhythms for input and output: study, then share. Ground through nature and breath. Practice vulnerability reps—one sincere share per day."
    },
    "8": {
      "overview": "Life Path 8 is the Powerhouse. You’re here to master material resources, leadership, and impact with integrity. Money and authority are mirrors for your inner balance. The lesson is ethical power—achieving without losing empathy or burning bridges.",
      "strengths": "Ambition, strategic thinking, resilience, and executive presence. You can scale ideas, steward teams, and turn vision into measurable results.",
      "challenges": "Workaholism, control, and win‑lose thinking. You may measure worth only by outcomes. When fear leads, relationships and health pay the tax.",
      "relationships": "Synergy with 2, 4, and 6 (support and structure). Sparks with 1 (drive) if egos cooperate. Tension with 7 (privacy vs. authority) or 9 (values clashes) unless purpose is shared.",
      "watchouts": "Transactional intimacy, rigidity around money, and neglecting rest. Power expands when you soften, not when you harden.",
      "coaching": "Define success beyond numbers: impact, wellbeing, legacy. Delegate to grow. Schedule restoration as a KPI—sleep, movement, connection."
    },
    "9": {
      "overview": "Life Path 9 is the Humanitarian. Compassion, art, and big‑picture vision shape your path. You’re here to complete cycles, release what’s done, and turn experience into wisdom that serves others. The lesson is discerning generosity—giving with boundaries and receiving with grace.",
      "strengths": "Empathy, creativity, and global perspective. You connect dots across cultures and can translate pain into healing messages. Your presence uplifts.",
      "challenges": "Over‑identifying with being the helper, idealism without logistics, and difficulty letting go. You may stay in endings too long out of loyalty to the past.",
      "relationships": "Beautiful with 2, 6, and 3 (heart and art). Growth with 7 (depth) and 8 (impact) when values align. Tension with 5 (inconsistency) unless the shared mission stays central.",
      "watchouts": "Saviour complex, leaky boundaries, and nostalgia loops. Closure creates space for your next calling.",
      "coaching": "Choose one cause or craft and go deep. Practice ‘loving limits.’ Ritualise release—journal, create, or meditate to complete cycles."
    },
    "11": {
      "overview": "Master Number 11 is the Illuminator. You carry heightened intuition and nervous‑system sensitivity. You’re here to channel insight and inspire others toward higher awareness. The lesson is grounding: stabilising your energy so inspiration becomes creation, not overwhelm.",
      "strengths": "Vision, empathy, spiritual perception, and catalytic words/art. People feel seen around you. Synchronicities increase when you honour your practices.",
      "challenges": "Anxiety, insomnia, and self‑doubt. You may swing between big visions and low energy. Without routines, sensitivity becomes static rather than signal.",
      "relationships": "Soothing with 2 and 6 (emotional safety). Supportive with 4 (structure) and 8 (execution) when you keep your boundaries. Intense with 7 or 9—beautiful if grounded, draining if not.",
      "watchouts": "Burnout from absorbing others’ pain, spiritual bypassing, and shiny‑object chasing. Protect your channel.",
      "coaching": "Create daily anchors: breath, movement, simple food, quiet time. Translate downloads into small tasks. Share your message even when it shakes—service steadies you."
    },
    "22": {
      "overview": "Master Number 22 is the Master Builder. You’re here to turn vision into structures that serve many. You combine practicality with big purpose. The lesson is paced ambition: building sustainably so success doesn’t cost your health or relationships.",
      "strengths": "Logistics, leadership, diplomacy, and long‑horizon planning. You can coordinate people and resources to manifest audacious projects.",
      "challenges": "Pressure, over‑responsibility, and perfectionism. You might carry the world and forget your body. Delegation and trust are non‑negotiable.",
      "relationships": "Strong with 4, 6, and 8 (shared organisation and care). Complementary with 2 (support) and 9 (mission). Friction with 5 (impulsivity) unless you allow play alongside plans.",
      "watchouts": "Work as identity, micromanagement, and postponing joy ‘until it’s done’. There’s always another milestone—celebrate now.",
      "coaching": "Design for stamina: teams, timelines, and rest cycles. Define ‘enough.’ Keep a personal practice that no success can buy back for you—sleep, nature, loved ones."
    },
    "33": {
      "overview": "Master Number 33 is the Master Healer/Teacher. Your path blends compassion, creativity, and service at scale. You’re here to model unconditional love without self‑erasure. The lesson is sacred boundaries: serving powerfully while honouring your own needs.",
      "strengths": "Healing presence, mentorship, creativity, and emotional alchemy. You can turn suffering into wisdom and art that comforts many.",
      "challenges": "Over‑giving, guilt, and taking on roles that aren’t yours. You may feel responsible for everyone’s feelings. Burnout is the shadow of your generosity.",
      "relationships": "Deep with 2, 6, and 9 (shared heart). Support from 4 and 8 helps ground your mission. Intensity with 11 and 7—wonderful with space, tricky without it.",
      "watchouts": "Martyr stories, boundary leaks, and forgetting play. Love is a verb to yourself first.",
      "coaching": "Choose sustainable service: clear scope, shared load, and creative outlets. Practice ‘compassion with edges’: kind, honest, and finite."
    }
  }
}